Code "CDX" by "GordinRamsay"
#region CURRENT BUGS:
/*
So it turns out that a mod like this, which essentially needs to create and run a new script in *every single combat encounter*, is a REALLY bad fit for an HMM code, mainly because I don't have a clean way to do a "clean refresh" of the script after every fight. Or after you die. Or after you reload a save. Or after you go to the title. Or pause behavior when you pause the game. And all of this needs to be able to dynamically swap between 4 completely unique characters, typically *without* resetting everything.
As such, there are some bugs. I've tried to eliminate them when I can, or at least mitigate how often they can occur, but I wasn't able to stomp them all. If you see some hacky solution in this code, it's probably related to my inexperience with C#, plus the aforementioned jank of trying to make this thing work as a code. Anyway, here are some known issues:

- Sometimes, when selecting "return to title", the game crashes. Consider this a sign from the heavens that you've played too much Sonic for the day. (Realistically, there isn't a lot I can do since we currently can't detect pauses via HMM)
- QuestTarget text can get stuck on screen, usually seen as a rank message on top of a Skill Bonus. Pretty sure this is caused by trying to set multiple targets too close to each other, but it's a rather rare bug, and doesn't really affect gameplay. Dying fixes this.

		if (supremeQTETimer_CheckLaser > 0.0f) //Just makes sure we don't try running the DiEvent stuff multiple times per laser.
		{
			supremeQTETimer_CheckLaser -= Time.GetDeltaTime();
			if (supremeQTETimer_CheckLaser <= 0.0f)
			{
				supremeQTETimer_CheckLaser = 0.0f;
			}
		}
		if (supremeQTETimer_PlayQTE > 0.0f)
		{
			supremeQTETimer_PlayQTE -= Time.GetDeltaTime();
			if (supremeQTETimer_PlayQTE <= 0.0f)
			{
				supremeQTETimer_PlayQTE = 0.0f;
				Lua.Call("PlayDiEvent", "test_bo2115");
			}
		}
		if (currentAnim == "LASER_START" && supremeQTETimer_CheckLaser <= 0.0f)
		{
			supremeQTETimer_CheckLaser = 4f;
			int playQTE = qteRNG.Next(supremeQTEChance, 5);
			if (playQTE == 4)
			{
				supremeQTEChance = 1;
				supremeQTETimer_PlayQTE = 0.8f;
			}
			else
			{
				supremeQTEChance += 1;
				if (supremeQTEChance > 4)
					supremeQTEChance = 4; //Redundant? Probably. Am I taking chances? Nope. Sanity checky, baybeeeee
				//Console.WriteLine("QTE MISSED. CHANCE: " + supremeQTEChance + " RNG WAS: " + playQTE);
			}
		}
	}
}
	//Utilities.IsRushActive(); 
Patch "Fix Giganto Scripting"
#lib "Lua"
{
	Lua.CreateLineHook
    (
        """
            NextSequence(40) -- we're replacing code here and our query removes this from a previous function

            FadeIn(0)
        """,
        
        "w1r03_sequence35.lua", "NextSequence(40)\n  Exit()",
        
        HookBehavior.Replace
    );
}
Library "GameHitStopParameter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 8)]
    public struct UnmanagedString
    {
        [FieldOffset(0)] public long pValue;

        public string Value
        {
            get
            {
                if (pValue == 0)
                    return string.Empty;

                return Marshal.PtrToStringAnsi((nint)pValue);
            }

            set => pValue = (long)Marshal.StringToHGlobalAnsi(value);
        }

        public UnmanagedString(string in_value)
        {
            Value = in_value;
        }

        public static implicit operator UnmanagedString(string in_value)
        {
            return new UnmanagedString(in_value);
        }

        public static bool operator ==(UnmanagedString in_left, string in_right)
        {
            return in_left.Value == in_right;
        }

        public static bool operator !=(UnmanagedString in_left, string in_right)
        {
            return !(in_left == in_right);
        }

        public override bool Equals(object in_obj)
        {
            if (in_obj is string str)
                return Value == str;

            return base.Equals(in_obj);
        }

        public override int GetHashCode()
        {
            return Value.GetHashCode();
        }

        public override string ToString()
        {
            return Value;
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x28)]
    public struct GameHitStopParameterData
    {
        [FieldOffset(0x00)] public UnmanagedString name;
        [FieldOffset(0x10)] public float scale;
        [FieldOffset(0x14)] public float time;
        [FieldOffset(0x18)] public float easeOutTime;
        [FieldOffset(0x1C)] public float delayTime;
        [FieldOffset(0x20)] public bool layerPlayer;
        [FieldOffset(0x21)] public bool layerEnemy;
        [FieldOffset(0x22)] public bool layerDamagedEnemy;
        [FieldOffset(0x23)] public bool layerCamera;
        [FieldOffset(0x24)] public bool layerOthers;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xA00)]
    public struct Root
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* GameHitStopParameterData[64] */ _data[2560];

        public unsafe GameHitStopParameterData* data
        {
            get
            {
                fixed (byte* p_data = _data)
                    return (GameHitStopParameterData*)p_data;
            }
        }
    }
}  

